import 'package:flutter/material.dart';
import 'azkar_detail_page.dart';

class AzkarPage extends StatelessWidget {
  const AzkarPage({super.key});

  @override
  Widget build(BuildContext context) {
    final categories = [
      {
        'title': 'أذكار الصباح',
        'icon': Icons.wb_sunny_outlined,
        'color': Colors.orange,
        'items': [
          AzkarItem(text: 'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهما وَهُوَ الْعَلِيُّ الْعَظِيمُ', count: 1),
          AzkarItem(text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ', count: 3),
          AzkarItem(text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ', count: 3),
          AzkarItem(text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ', count: 3),
          AzkarItem(text: 'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَع-وذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر', count: 1),
          AzkarItem(text: 'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ', count: 1),
          AzkarItem(text: 'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً', count: 3),
          AzkarItem(text: 'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك', count: 4),
          AzkarItem(text: 'اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر', count: 1),
          AzkarItem(text: 'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم', count: 7),
          AzkarItem(text: 'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـو السّمـيعُ العَلـيم', count: 3),
          AzkarItem(text: 'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور', count: 1),
          AzkarItem(text: 'أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ', count: 1),
          AzkarItem(text: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه', count: 3),
          AzkarItem(text: 'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَع-وذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ', count: 3),
          AzkarItem(text: 'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَ-ينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَع-وذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي', count: 1),
          AzkarItem(text: 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ', count: 3),
          AzkarItem(text: 'أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَع-وذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه', count: 1),
          AzkarItem(text: 'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم', count: 1),
          AzkarItem(text: 'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق', count: 3),
          AzkarItem(text: 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد', count: 10),
          AzkarItem(text: 'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ', count: 3),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ', count: 3),
          AzkarItem(text: 'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ', count: 3),
          AzkarItem(text: 'يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ', count: 3),
          AzkarItem(text: 'اللَّهُمَّ إِنِي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ', count: 1),
          AzkarItem(text: 'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ', count: 100),
          AzkarItem(text: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ', count: 100),
          AzkarItem(text: 'أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ', count: 100),
        ]
      },
      {
        'title': 'أذكار المساء',
        'icon': Icons.nightlight_outlined,
        'color': Colors.indigo,
        'items': [
          AzkarItem(text: 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ', count: 1, reference: 'آية الكرسى - البقرة 255'),
          AzkarItem(text: 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ', count: 1, reference: 'البقرة 285 - 286'),
          AzkarItem(text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ', count: 3, reference: 'الإخلاص والمعوذتين'),
          AzkarItem(text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ', count: 3),
          AzkarItem(text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ', count: 3),
          AzkarItem(text: 'أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر', count: 1),
          AzkarItem(text: 'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ', count: 1),
          AzkarItem(text: 'رَضيـتُ بِاللهِ رَبَّـاً وَ بِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً', count: 3),
          AzkarItem(text: 'اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك', count: 4),
          AzkarItem(text: 'اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر', count: 1),
          AzkarItem(text: 'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم', count: 7),
          AzkarItem(text: 'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـو السّمـيعُ العَلـيم', count: 3),
          AzkarItem(text: 'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ', count: 1),
          AzkarItem(text: 'أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ', count: 1),
          AzkarItem(text: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه', count: 3),
          AzkarItem(text: 'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ', count: 3),
          AzkarItem(text: 'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ', count: 3),
          AzkarItem(text: 'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي', count: 1),
          AzkarItem(text: 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ', count: 3),
          AzkarItem(text: 'أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُـمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا', count: 1),
          AzkarItem(text: 'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم', count: 1),
          AzkarItem(text: 'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق', count: 3),
          AzkarItem(text: 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد', count: 10),
          AzkarItem(text: 'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ', count: 3),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ', count: 3),
          AzkarItem(text: 'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ', count: 3),
          AzkarItem(text: 'يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ', count: 3),
          AzkarItem(text: 'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ', count: 100),
          AzkarItem(text: 'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ , وَمَا لَمْ يَشَأْ لَمْ يَكُنْ , وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ , وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي , وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا , إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ', count: 1),
          AzkarItem(text: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ', count: 100),
        ]
      },
      {
        'title': 'أذكار بعد السلام',
        'icon': Icons.mosque_outlined,
        'color': Colors.teal,
        'items': [
          AzkarItem(text: 'أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله\nاللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام', count: 1),
          AzkarItem(text: 'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد', count: 1),
          AzkarItem(text: 'لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون', count: 1),
          AzkarItem(text: 'سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر', count: 33),
          AzkarItem(text: 'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير', count: 1),
          AzkarItem(text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ\nبِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ\nبِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ', count: 1, reference: 'ثلاث مرات بعد صلاتي الفجر والمغرب ومرة بعد الصلوات الأخرى'),
          AzkarItem(text: 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ', count: 1, reference: 'آية الكرسى - البقرة 255'),
          AzkarItem(text: 'لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير', count: 10, reference: 'عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح'),
          AzkarItem(text: 'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً', count: 1, reference: 'بَعْد السّلامِ من صَلاةِ الفَجْر'),
          AzkarItem(text: 'اللَّهُمَّ أَجِرْنِي مِنْ النَّار', count: 7, reference: 'بعد صلاة الصبح والمغرب'),
          AzkarItem(text: 'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ', count: 1),
        ]
      },
      {
        'title': 'أذكار النوم',
        'icon': Icons.bedtime_outlined,
        'color': Colors.deepPurple,
        'items': [
          AzkarItem(text: 'بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.', count: 1),
          AzkarItem(text: 'اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة', count: 1),
          AzkarItem(text: 'اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك', count: 3),
          AzkarItem(text: 'بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا', count: 1),
          AzkarItem(text: 'الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي', count: 1),
          AzkarItem(text: 'اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَع_وذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم', count: 1),
          AzkarItem(text: 'اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت', count: 1),
          AzkarItem(text: 'سُبْحَانَ اللَّهِ', count: 33),
          AzkarItem(text: 'الْحَمْدُ لِلَّهِ', count: 33),
          AzkarItem(text: 'اللَّهُ أَكْبَرُ', count: 34),
          AzkarItem(text: 'يجمع كفيه ثم ينفث فيهما والقراءة فيهما: {قل هو الله أحد} و{قل أعوذ برب الفلق} و{قل أعوذ برب الناس} ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده', count: 3),
          AzkarItem(text: 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ', count: 1, reference: 'البقرة 285 - 286'),
          AzkarItem(text: 'آية الكرسى: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ', count: 1, reference: 'البقرة 255'),
          AzkarItem(text: 'أذكار من قلق في فراشه ولم ينم: "اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت"\n"أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون"', count: 1),
          AzkarItem(text: 'أذكار الأحلام: "الرؤيا الصالحة / الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا تضره"', count: 1),
        ]
      },
      {
        'title': 'أذكار الإستيقاظ',
        'icon': Icons.alarm_on_outlined,
        'color': Colors.amber,
        'items': [
          AzkarItem(text: 'الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور', count: 1),
          AzkarItem(text: 'الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه', count: 1),
          AzkarItem(text: 'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي', count: 1),
        ]
      },
      {
        'title': 'دُعَاءُ خَتْمِ القُرْآنِ الكَريمِ',
        'icon': Icons.menu_book_outlined,
        'color': Colors.green,
        'items': [
          AzkarItem(text: 'اللَّهُمَّ ارْحَمْنِي بالقُرْءَانِ وَاجْعَلهُ لِي إِمَاماً وَنُوراً وَهُدًى وَرَحْمَةً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ ذَكِّرْنِي مِنْهُ مَانَسِيتُ وَعَلِّمْنِي مِنْهُ مَاجَهِلْتُ وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَارَبَّ العَالَمِينَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُعِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِمَهُ وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ فِيهِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً هَنِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍ وَلاَ فَاضِحٍ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ العِلْمِ وَخَيْرَ العَمَلِ وَخَيْرَ الثَّوَابِ وَخَيْرَ الحَيَاةِ وَخيْرَ المَمَاتِ وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي وَحَقِّقْ إِيمَانِي وَارْفَعْ دَرَجَتِي وَتَقَبَّلْ صَلاَتِي وَاغْفِرْ خَطِيئَاتِي وَأَسْأَلُكَ العُلَا مِنَ الجَنَّةِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمِ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالفَوْزَ بِالجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا، وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَاتَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعْصِيَتِكَ وَمِنْ طَاعَتِكَ مَاتُبَلِّغُنَا بِهَا جَنَّتَكَ وَمِنَ اليَقِينِ مَاتُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَاأَحْيَيْتَنَا وَاجْعَلْهُ الوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا', count: 1),
          AzkarItem(text: 'اللَّهُمَّ لَا تَدَعْ لَنَا ذَنْبًا إِلَّا غَفَرْتَهُ وَلَا هَمَّا إِلَّا فَرَّجْتَهُ وَلَا دَيْنًا إِلَّا قَضَيْتَهُ وَلَا حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَةِ إِلَّا قَضَيْتَهَا يَاأَرْحَمَ الرَّاحِمِينَ', count: 1),
          AzkarItem(text: 'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِذَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ وَصَلَّى اللهُ عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأَصْحَابِهِ الأَخْيَارِ وَسَلَّمَ تَسْلِيمًا كَثِيراً', count: 1),
        ]
      },
      {
        'title': 'أسماء الله الحسنى',
        'icon': Icons.auto_awesome_outlined,
        'color': Colors.brown,
        'items': [
          AzkarItem(text: 'الله - الرحمن - الرحيم - الملك - القدوس', count: 1),
          AzkarItem(text: 'السلام - المؤمن - المهيمن - العزيز - الجبار', count: 1),
          AzkarItem(text: 'المتكبر - الخالق - البارئ - المصور - الأول', count: 1),
          AzkarItem(text: 'الآخر - الظاهر - الباطن - المالك - المليك', count: 1),
          AzkarItem(text: 'الهادي - السميع - البصير - الواسع - المحيط', count: 1),
          AzkarItem(text: 'علّام الغيوب - الشاكر - البر - التواب - الرؤوف', count: 1),
          AzkarItem(text: 'الولي - المولى - الرب - الخلاق - القدير', count: 1),
          AzkarItem(text: 'النصير - الغني - الحميد - المجيد - الحق', count: 1),
          AzkarItem(text: 'المبين - القوي - المتين - المنتقم - العفو', count: 1),
          AzkarItem(text: 'الغفور - الحليم - القريب - المجيب - الحي', count: 1),
          AzkarItem(text: 'القيوم - العلي - العظيم - الكبير - المتعال', count: 1),
          AzkarItem(text: 'اللطيف - الخبير - الوهاب - الرزاق - الحسيب', count: 1),
          AzkarItem(text: 'الرقيب - الشهيد - المقيت - الفتاح - العليم', count: 1),
          AzkarItem(text: 'الحكيم - الجامع - القادر - المقتدر - فاطر السموات والأرض', count: 1),
          AzkarItem(text: 'عالم الغيب والشهادة - بديع السموات والأرض - نور السماوات والأرض - الواحد - الأحد', count: 1),
          AzkarItem(text: 'الصمد - القاهر - القهار - العالم - الحكم', count: 1),
          AzkarItem(text: 'الإله - الحفي - الودود - الحافظ - الحفيظ', count: 1),
          AzkarItem(text: 'الغالب - الكافي - المنّان - المستعان - الوارث', count: 1),
          AzkarItem(text: 'الكفيل - الوكيل - الغفار - الكريم - الشكور', count: 1),
          AzkarItem(text: 'الأعلى - الأكرم - مالك الملك - ذو الجلال والإكرام', count: 1),
        ]
      },
      {
        'title': 'أدعية للميّت',
        'icon': Icons.favorite_border_outlined,
        'color': Colors.blueGrey,
        'items': [
          AzkarItem(text: 'أدعية للمتوفى (ذكور):\n\nاللَّهُمَّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر ومن عذاب النّار.\nاللَّهُمَّ عامله بما أنت أهله، ولا تعامله بما هو أهله.\nاللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.\nاللَّهُمَّ إن كان محسناً فزد من حسناته، وإن كان مسيئاً فتجاوز عن سيّئاته.\nاللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب.\nاللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته.\nاللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين.\nاللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.\nاللَّهُمَّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة.\nاللَّهُمَّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها.\nاللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور.\nاللَّهُمَّ إنّه في ذمّتك وحبل جوارك، فقِهِِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه إنّك أنت الغفور الرّحيم.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه.\nاللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به.\nاللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السؤال.\nاللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه.\nاللَّهُمَّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين', count: 1),
          AzkarItem(text: 'اللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود.\nاللَّهُمَّ احمه تحت الأرض، واستره يوم العرض، ولا تخزه يوم يبعثون "يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم".\nاللَّهُمَّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنة مطمئنّة، ولقّنه حجّته.\nاللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن، وبجود رضوانك واثق، وإلى أعلى درجاتك سابق.\nاللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك.\nاللَّهُمَّ انظر إليه نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم.\nاللَّهُمَّ اعف عنه فإنّك القائل "ويعفو عن كثير".\nاللَّهُمَّ إنّه جاء ببابك، وأناخ بجنابك، فَجد عليه بعفوك وإكرامك وجود إحسانك.\nاللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه، وتقرّ بها عينه.\nاللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً.\nاللَّهُمَّ احشره مع أصحاب اليمين، واجعل تحيّته سلامٌ لك من أصحاب اليمين', count: 1),
          AzkarItem(text: 'اللَّهُمَّ بشّره بقولك "كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية".\nاللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.\nاللَّهُمَّ لا نزكّيه عليك، ولكنّا نحسبه أنّه أمن وعمل صالحاً، فاجعل له جنّتين ذواتي أفنان بحقّ قولك: "ولمن خاف مقام ربّه جنّتان".\nاللَّهُمَّ شفع فيه نبيّنا ومصطفاك، واحشره تحت لوائه، واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اجعله في جنّة الخلد "الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا".\nاللَّهُمَّ إنّه صبر على البلاء فلم يجزع، فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل "إنّما يوفي الصّابرون أجرهم بغير حساب".\nاللَّهُمَّ إنّه كان مصلّ لك، فثبّته على الصّراط يوم تزل الأقدام.\nاللَّهُمَّ إنّه كان صائماً لك، فأدخله الجنّة من باب الريّان.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إنّه كان لكتابك تالٍ وسامع، فشفّع فيه القرآن، وارحمه من النّيران، واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها، وآخر حرفٍ تلاه.\nاللَّهُمَّ ارزقه بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ اّية سعادة، وبكلّ سورة سلامة، وبكل جْزءٍ جزاء.\nاللَّهُمَّ ارحمه فإنّه كان مسلماً، واغفر له فإنّه كان مؤمناً، وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً، وسامحه فإنّه كان لكتابك مرتّلاً.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنَا وأنثانا.\nاللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان.\nاللَّهُمَّ لا تحرمنا أجره ولا تضللنا بعده.\nاللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين.\nاللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات.\nاللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ، وبلغتِ التراقِ، وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ، إليك يا ربَّنا يومئذٍ المساق.\nاللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم.\nاللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولامال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال.\nاللَّهُمَّ ارحمنا إذا نَسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا.\nاللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إنّه عبدك وابن عبدك وابن أمتك مات وهو يشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر له إنّك أنت الغفّار.\nاللَّهُمَّ لا تحرمنا أجره، ولا تفتنّا بعده، واغفر لنا وله، واجمعنا معه في جنّات النّعيم يا ربّ العالمين.\nاللَّهُمَّ أنزل على أهله الصّبر والسلوان وارضهم بقضائك.\nاللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد.\nاللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى اّله وصحبه وسلّم إلى يوم الدّين', count: 1),
          AzkarItem(text: 'أدعية للمتوفية (إناث):\n\nاللَّهُمَّ أبدلها داراً خيراً من دارها، وأهلاً خيراً من أهلها، وأدخلها الجنّة، وأعذها من عذاب القبر ومن عذاب النّار.\nاللَّهُمَّ عاملها بما أنت أهله، ولا تعاملها بما هى أهله.\nاللَّهُمَّ اجزها عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.\nاللَّهُمَّ إن كانت محسنةً فزد من حسناتها، وإن كان مسيئةً فتجاوز عن سيّئاتها.\nاللَّهُمَّ أدخلها الجنّة من غير مناقشة حساب ولا سابقة عذاب.\nاللَّهُمَّ اّنسها في وحدتها وفي وحشتها وفي غربتها.\nاللَّهُمَّ أنزلها منزلاً مباركاً وأنت خير المنزلين.\nاللَّهُمَّ أنزلها منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اجعل قبرها روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.\nاللَّهُمَّ افسح لها في قبرها مدّ بصرها، وافرش قبرها من فراش الجنّة.\nاللَّهُمَّ أعذها من عذاب القبر، وجفاف ِالأرض عن جنبيها.\nاللَّهُمَّ املأ قبرها بالرّضا والنّور والفسحة والسّرور.\nاللَّهُمَّ إنّها في ذمّتك وحبل جوارك، فقِهِا فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر لهه وارحمها إنّك أنت الغفور الرّحيم.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إنها أمتك وبنت أمتك خرجت من الدّنيا وسعتها ومحبوبيها وأحبائها فيها إلى ظلمة القبر وما هى لاقته.\nاللَّهُمَّ إنّها كانت تشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به.\nاللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمها ولا تعذّبها، وأن تثبّتها عند السؤال.\nاللَّهُمَّ إنّها نَزَلت بك وأنت خير منزولٍ به، وأصبحت فقيرةً إلى رحمتك وأنت غنيٌّ عن عذابها.\nاللَّهُمَّ آتها برحمتك ورضاك، وقهِا فتنة القبر وعذابه، وآتها برحمتك الأمن من عذابك حتّى تبعثها إلى جنّتك يا أرحم الرّاحمين', count: 1),
          AzkarItem(text: 'اللَّهُمَّ انقلها من مواطن الدّود وضيق اللحود إلى جنّات الخلود.\nاللَّهُمَّ احمها تحت الأرض، واسترها يوم العرض، ولا تخزها يوم يبعثون “يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم”.\nاللَّهُمَّ يمّن كتابها، ويسّر حسابها، وثقّل بالحسنات ميزانها، وثبّت على الصّراط أقدامها، وأسكنها في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أمّنها من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسها آمنة مطمئنّة، ولقّنها حجّتها.\nاللَّهُمَّ اجعلها في بطن القبر مطمئنّةً وعند قيام الإشهاد آمنةً، وبجود رضوانك واثقةً، وإلى أعلى درجاتك سابقةً.\nاللَّهُمَّ اجعل عن يمينها نوراً حتّى تبعثها آمنةً مطمئنّةً في نورٍ من نورك.\nاللَّهُمَّ انظر إليها نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أسكنها فسيح الجنان، واغفر لها يا رحمن، وارحمها يا رحيم، وتجاوز عمّا تعلم يا عليم.\nاللَّهُمَّ اعف عنها فإنّك القائل “ويعفو عن كثير”.\nاللَّهُمَّ إنّها جاءت ببابك، وأناخت بجنابك، فَجد عليها بعفوك وإكرامك وجود إحسانك.\nاللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمها رحمةً تطمئنّ بها نفسها، وتقرّ بها عينها.\nاللَّهُمَّ احشرها مع المتّقين إلى الرّحمن وفداً.\nاللَّهُمَّ احشرها مع أصحاب اليمين، واجعل تحيّتها سلامٌ لك من أصحاب اليمين', count: 1),
          AzkarItem(text: 'اللَّهُمَّ بشّرها بقولك “كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية”\nاللَّهُمَّ اجعلها من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.\nاللَّهُمَّ لا نزكّيها عليك، ولكنّا نحسبها أنّها أمنت وعملت صالحاً، فاجعل لها جنّتين ذواتي أفنان بحقّ قولك: “ولمن خاف مقام ربّه جنّتان”.\nاللَّهُمَّ شفع فيها نبيّنا ومصطفاك، واحشرها تحت لوائه، واسقها من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اجعلها في جنّة الخلد "الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا".\nاللَّهُمَّ إنّها صبرت على البلاء فلم تجزع، فامنحها درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل "إنّما يوفي الصّابرون أجرهم بغير حساب".\nاللَّهُمَّ إنّها كانت تصلّى لك، فثبّتها على الصّراط يوم تزل الأقدام.\nاللَّهُمَّ إنّها كانت صائمةً لك، فأدخلها الجنّة من باب الريّان', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إنّها كانت لكتابك تاليةً وسامعةً، فشفّع فيها القرآن، وارحمه من النّيران، واجعلها يا رحمن ترتقي في الجنّة إلى آخر آية قرأها أو سمعها، وآخر حرفٍ تلته.\nاللَّهُمَّ ارزقها بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ اّية سعادة، وبكلّ سورة سلامة، وبكل جْزءٍ جزاء.\nاللَّهُمَّ ارحمها فإنّها كان مسلمةً، واغفر لها فإنّها كان مؤمنةً، وأدخلها الجنّة فإنّها كانت بنبيّك مصدّقاً، وسامحها فإنّها كانت لكتابك مرتّلةً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إنّها امتك بنت أمتك ماتت وهى تشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر لها إنّك أنت الغفّار.\nاللَّهُمَّ لا تحرمنا أجرها، ولا تفتنّا بعدها، واغفر لنا ولها، واجمعنا معها في جنّات النّعيم يا ربّ العالمين.\nاللَّهُمَّ أنزل على أهلها الصّبر والسلوان وارضهم بقضائك.\nاللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد.\nاللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى اّله وصحبه وسلّم إلى يوم الدّين', count: 1),
          AzkarItem(text: 'أدعية للميّت الطفل الصغير (ذكر أو أنثى):\n\nاللَّهُمَّ اجْعَلْهُ فَرَطَاً وَذُخْراً لِوالِدَيْهِ، وشَفِيعاً مُجاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوازِيْنَهُما، وأعْظِمْ بهِ أُجُورَهُما، وألْحِقْهُ بِصالِحِ الـمُؤْمِنينَ، واجْعَلْهُ فِي كَفالَةِ إِبْراهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذابَ الجَحِيمِ، وأبْدِلْهُ داراً خَيْراً مِنْ دارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لأسْلافِنا، وَأَفْراطِنا، وَمَنْ سَبَقَنا بالإيْمانِ', count: 1),
          AzkarItem(text: 'الدّعاء للميّت في صّلاة الجنازة:\n\nاللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعافِهِ وَاعْفُ عَنْهُ ، وَأَكْرِمْ نُزُلَهُ ، وَوَسِّعْ مُدْخَلَهُ ، وَاغْسِلْهُ بِالْماءِ وَالثَّلْجِ وَالْبَرَدِ ، وَنَقِّهِ مِنْ الْخَطايا كَما نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دارِهِ ، وَأَهْلًا خَيْراً مِنْ أَهْلِهِ ، وَزَوْجاً خَيْراً مِنْ زَوْجِهِ ، وَأَدْخِلْهُ الْجَنَّةَ ، وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذابَ النَّارِ', count: 1),
      ]
        }
      ,
      {
        'title': 'الرُّقية الشرعية',
        'icon': Icons.shield_outlined,
        'color': Colors.redAccent,
        'items': [
          AzkarItem(text: 'الرُّقية الشرعية من القرآن والسنة\nالرقية الشرعية أسباب شرعية للعلاج والاستشفاء والشفاء من الله سبحانه وتعالى ولا يملك أحد من الخلق ضراً ولا نفعاً.\n\nإرشادات عامة:\n* أن لا يعتقد الراقي أن الرقية تؤثر بذاتها بل بذات الله.\n* كون الراقي والمرقي على طهارة تامة.\n* استقبال الراقي القبلة.\n* لزوم تدبر نصوص الرقية واستحضار الخشوع.\n* النفث (نفخ لطيف مع بعض ريق) في أثناء القراءة.\n* وضع اليد على موضع الألم (مع مراعاة المحارم)', count: 1),
          AzkarItem(text: 'الرُّقية الشرعية من القرآن الكريم (1):\n\n* بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ (1) الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (2) الرَّحْمَنِ الرَّحِيمِ (3) مَالِكِ يَوْمِ الدِّينِ (4) إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ (5) اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ (6) صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ (7).\n* اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ', count: 1),
          AzkarItem(text: 'الرُّقية الشرعية من القرآن الكريم (2):\n\n* لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.\n* قُلْ هُوَ اللَّهُ أَحَدٌ... | قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ... | قُلْ أَعُوذُ بِرَبِّ النَّاسِ...', count: 1),
          AzkarItem(text: 'الرُّقية الشرعية من السنة النبوية (1):\n\n* أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ.\n* أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ.\n* أعوذُ بكلماتِ اللهِ التامَّةِ ، مِن كُلِّ شيطانٍ وهامَّةٍ ، ومِن كُلِّ عَيْنٍ لامَّةٍ.\n* أعوذُ بكلماتِ اللهِ التامَّاتِ مِن شرِّ ما خَلق.\n* بِسْمِ اللَّهِ أَرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ، اللَّهُ يَشْفِيكَ، بِسْمِ اللَّهِ أَرْقِيكَ', count: 1),
          AzkarItem(text: 'الرُّقية الشرعية من السنة النبوية (2):\n\n* بِسْمِ اللَّهِ (ثَلَاثًا)، أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ (سَبْعَ مَرَّاتٍ).\n* أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يُعَافِيَكَ وَيَشْفِيَكَ.\n* اللَّهُمَّ ربَّ النَّاسِ، أَذْهِب الْبَأسَ، واشْفِ، أَنْتَ الشَّافي لا شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفاءً لا يُغَادِرُ سقَماً.\n* بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. (ثلاث مرات)', count: 1),
        ]
      },
      {
        'title': 'أذكار الوضوء',
        'icon': Icons.water_drop_outlined,
        'color': Colors.lightBlue,
        'items': [
          AzkarItem(text: 'قبل الوضوء: بِسْمِ ٱللّٰهِ', count: 1),
          AzkarItem(text: 'بعد الوضوء: "أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ لهُ ، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه".\n"اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ".\n"سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ"', count: 1),
        ]
      },
      {
        'title': 'جوامع الدعاء',
        'icon': Icons.all_inclusive_outlined,
        'color': Colors.deepOrange,
        'items': [
          AzkarItem(text: 'اللَّهُمَّ يَا بَارِئَ البَرِيَّاتِ ، وَغَافِرَ الخَـطِيَّاتِ ، وَعَالِمَ الخَفِيَّاتِ... اغْفِرْ لِي ذُنُوبِي ، وَاسْتُرْ عُيُوبِيَ... إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.\nاللَّهُمَّ يَا سَمِيعَ الدَّعَوَاتِ... اغْفِرْ لِلْمُسْلِمِينَ وَالمُسْلِمَاتِ... إِنَّكَ سَمِيعٌ قَرِيبٌ مُجِيبُ الدَّعَوَاتِ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ... أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.\nاللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العّفْوَ فَاعْفُ عَنِّي.\nاللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ... اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي.\nاللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي.\nاللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ... فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِإِلَّا أَنْتَ.\nاللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي وَاهْدِنِي ، وَعَافِنِي وَارْزُقْنِي ، وَاجْبُرْنِي ، وَارْفَعْنِي.\nاللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ... اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّلهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ.\nاللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ ، فَاغْفِرْهَا لِي.\nاللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَوَسِّعْ لِي فِي دَارِي ، وَبَارِكْ لِي فِي رِزْقِي.\nاللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا...\nاللَّهُمَّ إِنَّا قَدْ أَطَعْنَاكَ فِي أَحَبِّ الأشْيَاءِ إِلَيْكَ أَنْ تُطَاعَ فِيْهِ ، الإيمَانِ بِكَ... اللَّهُمَّ فَاغْفِرْ لَنَا مَا بَيْنَهُمَا', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ... أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْ-تَ.\nاللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَارِ.\nاللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيْمَانِ...\nاللَّهُمَّ أَقِلْ عَثَرَاتِنَا ... وَتَوَفَّنَا مَعَ الأَبْرَارِ.\nاللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ... اللَّهُمَّ نَقِّنِي مِنْ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِ-نَ الدَّنَس', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظلْماً كَثِيراً ، وَلا يَغْفِرُ الذُّنُوب إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ ، الصَّمَدُ... أَنْ تَغْفِرَ لِي ذُنُ-وبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.\nاللَّهُمَّ إِلَهِي : حُجَّتِي حَاجَتِي ، وَعُدَّتِي فَاقَتِي ، فَارْحَمْنِي.\nاللَّهُمَّ إِلَهِي : كَيْفَ أمْتَنِعُ بِالذَّنْبِ مِنَ الدُّعَاءِ... فَإِنْ غَفَرْتَ فَخَيرُ رَاحِمٍ أَنْتَ.\nاللَّهُمَّ إِلَهِي: أَسْأَلُكَ تَذَلُّلاً فَأَعْطِنِي تَفَضُّلاً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ يَامَنْ عَلَى العَرْشِ اسْتَوَى... وَأَسْعَدَ وَأَشْقَى... وَأَعْطَى وَمَنَعَ ، وَرَفَعَ وَوَضَعَ.\nاللَّهُمَّ يَا مَنْ شَقَّ البِحَارَ... وَأَحْيَا الضَّمَائِرَ وَالأَفْكَارَ.\nاللَّهُمَّ اهْدِنَا فِيمَنْ هَدَيْتَ... وَتَوَلَّنَا فِيمَنْ تَوَلَّيْتَ.\nاللَّهُمَّ اهْدِنَا الصِّرَاطَ المُسْتَقِيمَ... وَالصَّالِحِينَ.\nاللَّهُمَّ وَفِّقْنَا لِهُدَاكَ وَاجْعَلْ عَمَلَنَا فِي رِضَاكَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ.\nاللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا.\nاللَّهُمَّ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلّ شَيءٍ قَدِيرٌ.\nاللَّهُمَّ حَبِّبْ إلَينَا الإيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا... وَاجْعَلْنَا مِنَ الرَّاشِدِينَ.\nاللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ خُذْ بِنَوَاصِينَا لِِلْبِرِّ وَالتَّقْوَى ، وَلِمَا تُحِبُّ مِنَ العَمَلِ وَتَرْضَى.\nاللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ... اهْدِنَا لِمَا اخْتُلِفَ فِيْهِ مِنَ الحَقِّ بِإذْنِكَ...\nاللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ... أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي... وَذَهَابَ هَمِّي.\nاللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً ... وَأَعْظِمْ لِي نُوراً.\nاللَّهُمَّ أَغْنِنِي بِالعِلْمِ ، وَزَيِّنِّي بِالحِلْمِ ، وَأَكْرِمْنِي بِالتَّقْوَى ، وَجَمِّلْنِي بِالعَافِيَة', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمَ الخَائِفِينَ مِنْكَ... وَلَحَاقاً بِالأَحْيَاءِ المَرْزُوقِينَ عِنْدَكَ.\nاللَّهُمَّ اهْدِنِي وَسَدِّدْنِي... اللَّهُمَّ أَلْهِمْنِي رُشْدِي ، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي.\nاللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي ، وَعَلِّمْنِي مَا يَنْفَعُنِي ، وَزِدْنِي عِلْماً.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً ، وَأَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ ثَبِّتْنِي وَاجْعَلْنِي هَادِياً مَهْدِيّاً.\nاللَّهُمَّ لَكَ أَسْلَمْتُ... أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ.\nاللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ... وَاصْرِفْ عَنِّي سَيِّئَها لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ.\nاللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي.\nاللَّهُمَّ فَالِقَ الحَبِّ وَالنَّوَى... يَا مَنْ جَعَلَ لَنَا النُّجُومَ لِنَهْتَدِيَ بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالبَحْرِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ جَلَّتْ قُدْرَتُكَ ، وَتَعَالَتْ حِكْمَتُكَ... وَلا إِلَهَ غَيْرُكَ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ... المَنَّانُ... ذُو الجَلالِ وَالإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ.\nاللَّهُمَّ ارْزُقْنَا رِزْقًا يَزِيدُنَا لَكَ شُكْراً... وَبِكَ عَمَّنْ سِوَاكَ غِنىً.\nاللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي ، وَانْقِطَاعِ عُمُرِي.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ فَإِنَّهُ لا يَمْلِكُهَا إِلاَّ أَنْتَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ رَبِّ لا تَذَرْنِي فَرْداً وَأَنْتَ خَيْرُ الْوَارِثِينَ.\nاللَّهُمَّ رَبِّ هَبْ لِيْ مِنَ الصَّالِحِينَ.\nاللَّهُمَّ قَنِّعْنِي بِمَا رَزَقْتَنِي... وَاخْلُفْ عَلَيَّ كُلّ غَائِبَةٍ لِي مِنْكَ بِخَيرٍ.\nاللَّهُمَّ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّة أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَاماً.\nاللَّهُمَّ يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ... وِإنْ مِنْ شَيءٍ إِلاَّ يُسَبِّحُ بِحَمْدِه', count: 1),
          AzkarItem(text: 'اللَّهُمَّ يَا مَنْ خَلَقَ الأَرْضَ وَالسَّمَاوَاتِ العُلَى... يَا مَنْ يَعْلَمُ السِّرَ وَأَخْفَى... يَا مَنْ لَهُ الأَسْمَاءُ الحُسْنَى... يَا مَنْ أَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى.\nاللَّهُمَّ أَنْتَ البَادِئُ بِالإِحْسَانِ... وَأَنْتَ الوَهَّابُ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة... وَأَعُوذُ بِكَ مَنَ النَّارِ...\nاللَّهُمَّ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً فِي الجَنَّةِ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَحْسِنْ عَاقِبَتِنَا فِي الأُمُورِ كُلِّهَا... وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ.\nاللَّهُمَّ رَبَّنَا اصْرِفْ عَنَّا عَذَاب جَهَنَّم إِنَّ عَذَابَهَا كَانَ غَرَاماً.\nاللَّهُمَّ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَاب النَّارِ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ ، وَأسْتَجِيرُ بِكَ مِنَ النَّارِ.\nاللَّهُمَّ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسِلِكَ... إِنَّكَ لا تُخْلِفُ المِيعَادِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ حَاسِبْنِي حِسَاباً يَسِيراً.\nاللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نُشْرِكَ بِكَ شَيْئاً نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لا نَعْلَمُهُ.\nاللَّهُمَّ إنِّيْ أعُوذُ بِكَ مِنْ جَهْدِ البَلاء... وســوء القضاء... يَا سَمِيْع الدُّعَاء.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ... وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَ-اتِ...\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ... وَشَرِّ فِتْنَةِ الغِنَى ، وَشَرِّ فِتْنَةِ الفَقْرِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اغْسِلْ قَلْبِي بِمَاء الثَّلْجِ وَالْبَرَدِ... اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالمَأْثَمِ وَالمَغْرَمِ.\nاللَّهُمَّ رَبِّ جِبْرَائِيلَ... أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ القَبْرِ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ...\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ ... وَسَيِّئِ الأَسْقَامِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ... اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا... أَنْتَ وَلِيُّهَا وَمَوْلاَهَا.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ... وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَقِ وَالأَعْمَالِ وَالأَهْوَاءِ وَالأَدْوَاءِ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ تُحَسِّنَ فِي لَوَائِحِ العُيُونِ عَلانِيَتِي... اللَّهُمَّ كَمَا أَسَأْتُ وَأَحْسَنْتَ إِلَيَّ ، فَإِذَا عُدْتُ فُعُدْ عَلَيَّ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْ-عِي... وَمِنْ شَرِّ بَصَ--رِي... وَمِن شـرِّ مَنِيِّي', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَقُولَ زُوراً... اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ وَالنِّفَاقِ... اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ...\nاللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ... أَعُوذُ بِكَ مِنْ شَرِّ كُلّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ... اقْضِ عَنَّا الدَّيْنَ وَأَغْنينا مِنَ الفَقْرِ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ ، وَغَلَبَةِ العَدُوِّ ، وَشَمَاتَةِ الأَعْدَاءِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الفَقْرِ وَالقِلَّةِ وَالذِّلَّةِ... اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الغِنَى ، وَمِنْ شَرِّ فِتْنَةِ الفَقْرِ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ... وَجَمِيعِ سَخَطِكَ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ يَوْمِ السُّوءِ... وَمِنْ صَاحِبِ السُّوءِ... فِي دَارِ المُقَامَةِ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لا يَخْشَعُ... أَعُوذُ بِكَ مِنْ هَؤُلاَءِ الأَرْبَعِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ التَّ-رَدِّي... وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيطَانُ عِنْدَ المَوْتِ... اللَّهُمَّ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ...\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ الأَشْرَارِ... إلاَّ طَارِقَاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنْ.\nاللَّهُمَّ رَبِّ أَعُوذُ بِكَ مِنْ أَعْيُنِ العَائِنِينَ...\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الجُوعِ... وَأَعُوذُ بِكَ مِنْ الخِيَانَةِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عُقُوقِ الأَبْنَاءِ... وَمِنْ شَمَاتَةِ الأَعْدَاءِ.\nاللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أنْ أَزِلَّ أَوْ أُزَلَّ... أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ.\nاللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَهْدِيكَ... اللَّهُمَّ إِيَّاكَ نَعْبُدُ... نَرْجُو رَحْمَتَكَ ، وَنَخْشَى عَذَابَكَ...\nاللَّهُمَّ رَبَّنَا أَعِزَّنَا بِالإِسْلامِ... وَارْفَعْ بِنَا رَايَةَ القُرْآنِ.\nاللَّهُمَّ مُنْزِلَ الكِتَابِ... أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ يَاحَيُّ يَا قَيُّومُ... اللَّهُمَّ أَظِلَّنِي فِيْ ظِلِّ عَرْشِكَ يَوْمَ لا ظِلَّ إِلاَّ ظِلُّكَ.\nاللَّهُمَّ أَظْهِرْ دِينَكَ عَلَى الدِّينِ كُلِّهُ وَلَوْ كَرِهَ المُشْرِكُونَ.\nاللَّهُمَّ يَا مَنْ يُجِيبُ المُضْطَرَّ... اكْشِفِ السُّوءَ عَنْ إِخْوَانِنَا الأُسَارَى... وَرُدَّهُمْ إِلَى أَهْلِيهِمْ سَالِمِينَ غَانِمِينَ.\nاللَّهُمَّ كُنْ لِلْمُسْلِمينَ وَالمُسْتَضْعَفِينَ فِي كُلَّ مَكَانٍ... وَتَولَّ بِنَفْسِكَ أَمْرَهُم.\nاللَّهُمَّ ارْفَعْ رَايَتَهُم ، وَاكْبِتْ عَدُوَّهُمْ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ وَحِّدْ صَفَّهُم ، وَاجْمَعْ كَلِمَتَهُم... اللَّهُمَّ فَاجْعَلِ الدَّائِرَةَ لَهُم لا عَلَيهِم وَالنَّصْرَ حَلِيفَهُمْ.. يَا رَبِّ.\nاللَّهُمَّ يَا خَيْرَ مَنْ سُئِلَ... وَأَبَرَّ مَنْ أَجَابَ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلَةِ... وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ فَوَاتِحَ الخَيرِ... آمِينَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ مَا آتِي... آمِينَ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَرْفَعَ ذِِكْرِي... وَتَغْفِرَ لِي ذَنْبِيَ ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تُبَارِكَ فِي نَفْسِي... فَتَقَبَّلْ حَسَناتِي ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.\nاللَّهُمَّ لَكَ الحَمْدُ كُلُّهُ... اللَّهُمَّ ابْسُطْ عَلَينَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ...\nاللَّهُمَّ حَبِّبْ إِلَينَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا... اللَّهُمَّ قَاتِلِ الكَفَرَةَ... إِلَهَ الحَقِّ.. آمِينَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ بِعِلْمِكَ الغَيبِ... لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ... اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الخَيْرَاتِ... وَأَسْأَلُكَ حُبَّكَ ، وَحُبَّ مَنْ يُحِبّـُكَ...\nاللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الخَيْرِ كُلِّهُ...\nاللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ محمد...\nاللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة... وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْراً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ... وَلا تُسَلِّطْ عَلَيْنَا مَنْ لا يَرْحَمْنَا.\nاللَّهُمَّ إِنَّا نَسْألُكَ مُوجِبَاتِ رَحْمَتِكَ... وَالنَّجَاةَ مِنَ النَّارِ.\nاللَّهُمَّ لا تَدَعْ لَنَا ذَنْبًا إِلاَّ غَفَرْتَهُ... بِفَضْلِكَ يَا أَكْرَمَ الأكْرَمِينَ.\nاللَّهُمَّ رَبِّ أَعِنِّي وَلا تُعِنْ عَلَيَّ... وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ.\nاللَّهُمَّ رَبِّ اجْعَلْنِي لَكَ شَكَّاراً... رَبِّ تَقَبَّلْ تَوْبَتِي... وَاسْلُلْ سَخِيمَةَ قَلْبِي', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنَّا نَسْألكَ يُسْراً لَيْسَ بَعْدَهُ عُسْرٌ... وَسَعَادَةً لَيْسَ بَعْدَهَا شَقَاءٌ.\nاللَّهُمَّ ألِّفْ بَيْنَ قُلُوبِنَا... وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا عَلَيْكَ قَابِلِينَ لَهَا وَأَتْمِمْهَا عَلَيْنَا.\nاللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ وَالأَبْصَارِ... وَخَيْرَ أَيَّامِنَا يَوْمَ نَلْقَاكَ وَأَنْتَ رَاضٍ عَنَّا.\nاللَّهُمَّ أَنْتَ الَّذِي خَلَقْتَنِي فَأَنْتَ تَهْدِينِ... إِلاَّ مَنْ أَتَى اللهَ بِقَلْبٍ سَلِيمٍ.\nاللَّهُمَّ احْفَظْنِي بِالإسْلاَمِ قَائِماً... وَلاَ تُشْمِتْ بِي عَدُوّاً وَلا حَاسِداً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ...\nاللَّهُمَّ يَا ذَا الحَبْلِ الشَّدِيدِ... إِنَّكَ رَحِيمٌ وَدُودٌ ، وَإِنَّكَ تَفْعَلُ مَا تُرِيدُ.\nاللَّهُمَّ اجْعَلْنَا هَادِينَ مُهْتَدِينَ... اللَّهُمَّ هَذَا الدُّعَاءُ وَمِنْكَ الإِجَابَةُ...\nاللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَاناً لا يَرْتَدُّ... مَعَ نَبِيِّكَ مُحَمَّدٍ فِي أَعْلَى جَنَّةِ الخُلْدِ.\nاللَّهُمَّ آتِنِي الحِكْمَةَ الَّتِي مَنْ أُوتِيَهَا فَقَدْ أُوْتِيَ خَيْراً كَثِيراً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنَ عِبَادَتِكَ.\nاللَّهُمَّ ارْحَمْنِي... وَانْصُرْنِي... لا إِلَهَ إِلاَّ أَنْتَ.\nاللَّهُمَّ زِدْنَا وَلا تَنْقُصْنَا... وَارْضَنَا وَارْضَ عَنَّا.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً ، وَمِيتَةً سَ-وِيَّةً ، وَمَرَدّاً غَيْرَ مُخْزٍ وَلا فَاضِحٍ.', count: 1),
          AzkarItem(text: 'اللَّهُمَّ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ... وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ وَالمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى ، وَالتُّقَى ، وَالعَفَافَ وَالغِنَى.\nاللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعَاً ، وَرِزْقاً طَ-يِّباً ، وَعَمَلاً مُتَقَبَّلاً.\nاللَّهُمَّ اغْفِرْ لِي ... أَعُوذُ بِاللهِ مِنْ ضِيقِ المَقَامِ يَوْمَ القِيامَةِ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ قِنِي شَرَّ نَفْسِي... اللَّهُمَّ اغْفِرْ لِي مَا أَسْرَرْتُ... وَمَا عَلِمْتُ ، وَمَا جَهِلُتُ.\nاللَّهُمَّ أَكْثِرْ مَالِي ، وَوَلَدِي... وَأَحْسِنْ عَمَلِي وَاغْفِرْ لِي.\nاللَّهُمَّ اسْتُرْ عَوَرَاتِي... وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.\nاللَّهُمَّ أَكْرِمْنِي وَلا تُهِنِّي... وَارْضَ عَنِّي وَأَرْضِنِي.\nاللَّهُمَّ افْتَحْ لَنَا فَتْحاً مُبِيناً... وَانْشُرْ عَلَيْنَا فَضْلَكَ وَرَحْمَتِكَ', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أعِنَّا عَلَى شَهَوَاتِ أَنْفُسِنَا... وَلا تَكِلْنَا إِلَى أَنْفُسِنَا وَلا إِلَى أَحَدٍ غَيْرَكَ.\nاللَّهُمَّ لا تَكِلْنَا إِلَى أَنْفُسِنَا طَرْفَةَ عَيْنٍ وَلا أَقَلَّ مِنْ ذَلِكَ.\nاللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.\nاللَّهُمَّ اشْغَلْ قُلُوبَنَا بِحُبِّكَ... وَالتَّفَقُّهَ فِي دِينِكَ.\nاللَّهُمَّ اشْفِ مَرْضَانَا ، وَارْحَمْ مَوْتَانَا... وَفُكَّ أَسْرَانَا', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَطْعِمْنَا مِنْ جُوعٍ... وَأَنْقِذْنَا مِنْ ضَلاَلَةٍ.\nاللَّهُمَّ اخْتِمْ بِالصَّالِحَاتِ أَعْمَالَنَا... وَبَلِّغْنَا مِمَّا يُرْضِ-يكَ آمَالَنَا.\nاللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي... وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ.\nاللَّهُمَّ اجْعَلْ خَيْرَ عُمُرِي أَوَاخِرَهُ... وَخَيْرَ أَيَّامِي يَوْمَ لِقَاكَ.\nاللَّهُمَّ احْفَظْنِي بِالإسْلامِ قَائِماً... وَلا تُشْمِتْ بِيَ عَدُوَّاً وَلا حَاسِدَاً', count: 1),
          AzkarItem(text: 'اللَّهُمَّ أَحْيِنَا مُسْلِمِينَ ، وَتَوَفَّنَا مُسْلِمِينَ ، وَأَلْحِقْنَا بِالصَّالِحِينَ.\nاللَّهُمَّ أَبْرِمْ لِهَذِهِ الأُمَّةِ أَمْرَ رُشْدٍ... وَيُنْهَى فِيْهِ عَنِ المُنْكَرِ.\nاللَّهُمَّ اللهمَّ صلِّ وسلِّمْ وبارِكْ علَى عَبْدِكَ ورَسُوْلِكَ محمَّد وعلى آله وصحبه أجمعين.', count: 1),
        ]
      },
      {
        'title': 'أدعية الأنبياء من القرآن الكريم',
        'icon': Icons.history_edu_outlined,
        'color': Colors.purple,
        'items': [
          AzkarItem(text: '"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ"', count: 1, reference: 'آدم علية السلام [الأعراف - 23]'),
          AzkarItem(text: '"رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا"\n" رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلُكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ"\n"رَّبِّ أَنزِلْنِي مُنزَلاً مُّبَارَكاً وَأَنتَ خَيْرُ الْمُنزِلِينَ"', count: 1, reference: 'نوح علية السلام'),
          AzkarItem(text: '"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ (127) رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ (128)"\n"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ (40) رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ (41)"\n"رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ (83) وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ (84) وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ (85)"\n"رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ (4) رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ (5)"\n"رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ"', count: 1, reference: 'إبراهيم علية السلام'),
          AzkarItem(text: '"إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ"', count: 1, reference: 'هود علية السلام [هود - 56]'),
          AzkarItem(text: '"رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ"\n"رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ"', count: 1, reference: 'لوط علية السلام'),
          AzkarItem(text: '"فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّني مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ"', count: 1, reference: 'يوسف علية السلام [يوسف - 101]'),
          AzkarItem(text: '"وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْماً عَلَى اللّهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ"', count: 1, reference: 'شعيب علية السلام [الأعراف - 89]'),
          AzkarItem(text: '"رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي"\n"رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيراً لِّلْمُجْرِمِينَ"\n"رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ"\n"رَبِّ اشْرَحْ لِي صَدْرِي (25) وَيَسِّرْ لِي أَمْرِي (26) وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي (27) يَفْقَهُوا قَوْلِي (28)"', count: 1, reference: 'موسى علية السلام'),
          AzkarItem(text: '"أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ"', count: 1, reference: 'أيوب علية السلام [الأنبياء - 83]'),
          AzkarItem(text: '"رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ"', count: 1, reference: 'سليمان علية السلام [النمل - 19]'),
          AzkarItem(text: '" لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ"', count: 1, reference: 'يونس علية السلام [الأنبياء - 87]'),
          AzkarItem(text: '"رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء"\n"رَبِّ لَا تَذَرْنِي فَرْداً وَأَنتَ خَيْرُ الْوَارِثِينَ"', count: 1, reference: 'زكريا علية السلام'),
          AzkarItem(text: '"إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ"', count: 1, reference: 'يعقوب علية السلام [يوسف - 86]'),
        ]
      },
      {
        'title': 'تسابيح',
        'icon': Icons.flare_outlined,
        'color': Colors.teal,
        'items': [
          AzkarItem(text: 'سُبْحَانَ اللَّهِ', count: 100, reference: 'يكتب له ألف حسنة أو يحط عنه ألف خطيئة'),
          AzkarItem(text: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ', count: 100, reference: 'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ'),
          AzkarItem(text: 'سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ', count: 100, reference: 'تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ'),
          AzkarItem(text: 'سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ', count: 100, reference: 'غرست له نخلة في الجنة'),
          AzkarItem(text: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ', count: 100, reference: 'ثقيلتان في الميزان حبيبتان إلى الرحمن'),
          AzkarItem(text: 'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ', count: 100, reference: 'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان'),
          AzkarItem(text: 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ', count: 100, reference: 'تملأ ميزان العبد بالحسنات'),
          AzkarItem(text: 'لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ', count: 100, reference: 'كنز من كنوز الجنة'),
          AzkarItem(text: 'الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد', count: 100, reference: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة'),
          AzkarItem(text: 'أستغفر الله', count: 100, reference: 'لفعل الرسول صلى الله عليه وسلم'),
          AzkarItem(text: 'سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ', count: 100, reference: 'أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات'),
          AzkarItem(text: 'لَا إِلَهَ إِلَّا اللَّهُ', count: 100, reference: 'أفضل الذكر لا إله إلاّ الله'),
          AzkarItem(text: 'الْلَّهُ أَكْبَرُ', count: 100, reference: 'من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء'),
          AzkarItem(text: 'سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي', count: 100, reference: 'خير الدنيا والآخرة'),
          AzkarItem(text: 'الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ', count: 100, reference: 'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا"'),
          AzkarItem(text: 'اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً', count: 100, reference: 'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ"'),
          AzkarItem(text: 'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ', count: 100, reference: 'في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم'),
        ]
      },
    ];

    return Scaffold(
      backgroundColor: Colors.grey[50],
      appBar: AppBar(
        title: const Text('الأذكار'),
        centerTitle: true,
        backgroundColor: Colors.transparent,
        elevation: 0,
      ),
      body: Padding(
        padding: const EdgeInsets.symmetric(horizontal: 16.0),
        child: GridView.builder(
          physics: const BouncingScrollPhysics(),
          gridDelegate: const SliverGridDelegateWithFixedCrossAxisCount(
            crossAxisCount: 2,
            crossAxisSpacing: 16,
            mainAxisSpacing: 16,
            childAspectRatio: 1.1,
          ),
          itemCount: categories.length,
          itemBuilder: (context, index) {
            final category = categories[index];
            return _buildCategoryCard(
              context,
              category['title'] as String,
              category['icon'] as IconData,
              category['color'] as Color,
              category['items'] as List<AzkarItem>,
            );
          },
        ),
      ),
    );
  }

  Widget _buildCategoryCard(BuildContext context, String title, IconData icon, Color color, List<AzkarItem> items) {
    return Card(
      elevation: 2,
      shape: RoundedRectangleBorder(borderRadius: BorderRadius.circular(20)),
      child: InkWell(
        onTap: () {
          Navigator.push(
            context,
            MaterialPageRoute(
              builder: (context) => AzkarDetailPage(
                title: title,
                azkarItems: items,
              ),
            ),
          );
        },
        borderRadius: BorderRadius.circular(20),
        child: Column(
          mainAxisAlignment: MainAxisAlignment.center,
          children: [
            Container(
              padding: const EdgeInsets.all(12),
              decoration: BoxDecoration(
                color: color.withOpacity(0.1),
                shape: BoxShape.circle,
              ),
              child: Icon(icon, size: 36, color: color),
            ),
            const SizedBox(height: 12),
            Padding(
              padding: const EdgeInsets.symmetric(horizontal: 8.0),
              child: Text(
                title,
                textAlign: TextAlign.center,
                style: const TextStyle(
                  fontSize: 16,
                  fontWeight: FontWeight.bold,
                  color: Colors.black87,
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
